cv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-05 Mon 15:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CV</title>
<meta name="author" content="Ronak Cuthill" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">CV</h1>

<div id="outline-container-org80a0a2f" class="outline-2">
<h2 id="org80a0a2f">Objective Statement</h2>
<div class="outline-text-2" id="text-org80a0a2f">
<p>
Growth-oriented new graduate with a bachelor's degree in math seeking
to leverage strong analytical skills for formal verification of ASIC/FPGA
designs.
</p>

<p>
Interested in furthering my education in professional and academic
settings to pursue a career in digital systems design.
</p>
</div>
</div>

<div id="outline-container-org5e2377a" class="outline-2">
<h2 id="org5e2377a">Education</h2>
<div class="outline-text-2" id="text-org5e2377a">
</div>
<div id="outline-container-orgd451e8e" class="outline-3">
<h3 id="orgd451e8e">B.Sc in Mathematics with Computer Science Minor at the University of Victoria - 2019 to 2023</h3>
<div class="outline-text-3" id="text-orgd451e8e">
<ul class="org-ul">
<li>Understanding of data structures and algorithms, from linked lists to graphs to hash tries.</li>
<li>Studied systems analysis and software development methods.</li>
<li>Understanding of computer architecture, interrupts, and embedded peripherals.</li>
<li>Design of digital circuits from logic to RTL level, with limited HDL experience.</li>
<li>Broad understanding of mathematics - 22 courses including including calculus, analysis, algebraic topology, and combinatorics.</li>
<li>Led efforts to create online study groups during the pandemic to support the education of my peers.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org11f38e3" class="outline-2">
<h2 id="org11f38e3">Projects</h2>
<div class="outline-text-2" id="text-org11f38e3">
<ul class="org-ul">
<li>Wrote a general-purpose buddy block memory allocator and mark and sweep garbage collector in C.</li>
<li>Created a compiler with a bytecode backend to a self-created virtual machine.</li>
<li>Programmed an STM32 on bare metal to blink a light and accept input.</li>
<li>Studied formal verification in Verilog.</li>
<li>Implemented a B-tree based in-memory database supporting insertion and selection.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfd18eaf" class="outline-2">
<h2 id="orgfd18eaf">Professional/Personal Experience</h2>
<div class="outline-text-2" id="text-orgfd18eaf">
</div>
<div id="outline-container-orgb952949" class="outline-3">
<h3 id="orgb952949">Driver at You Move Me Victoria - 2022</h3>
<div class="outline-text-3" id="text-orgb952949">
<ul class="org-ul">
<li>Rapidly ascended the responsibility ladder at You Move Me Victoria from a laborer to team leader position in under two months by leading my teams to reduce packing time on the job.</li>
</ul>
</div>
</div>

<div id="outline-container-org7f8b9fb" class="outline-3">
<h3 id="org7f8b9fb">Scholar Athlete, and Entrepreneur at South Lakes High School - 2015 to 2018</h3>
<div class="outline-text-3" id="text-org7f8b9fb">
<ul class="org-ul">
<li>Took initiative in my education during childhood to take university
courses in mathematics before high school hrough the John;s Hopkins
CTY program and George Mason University.  Started learning calculus
at 7 years of age and completed all math courses available in secondary education
by 15.</li>
<li>Led my high-school shotput team to a higher level of competition - increased team size to a dozen individuals and brought five of them to compete on the state level.</li>
<li>Started a landscaping and hauling business with temporary employees to address the needs of my local community.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6545489" class="outline-2">
<h2 id="org6545489">Skills</h2>
<div class="outline-text-2" id="text-org6545489">
<ul class="org-ul">
<li>Problem-solving</li>
<li>Leadership</li>
<li>Teamwork</li>
<li>Curiosity</li>
<li>C/Assembler</li>
<li>Verilog</li>
<li>Python</li>
<li>Forth</li>
<li>Haskell</li>
<li>Git</li>
<li>Emacs</li>
<li>Linux</li>
<li>Nix</li>
<li>Autotools</li>
</ul>
</div>
</div>

<div id="outline-container-orgf843321" class="outline-2">
<h2 id="orgf843321">Contact</h2>
<div class="outline-text-2" id="text-orgf843321">
<p>
ronak.cuthill@gmail.com
</p>

<p>
(778)-700-1618
</p>

<p>
<a href="http://github.com/ton2790">http://github.com/ton2790</a>
</p>
</div>
</div>
</div>
</body>
</html>